In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('dataset 1.csv')

In [3]:
# read xlsx file using function read_xls. In case there are other formats, the function will be different.
df2 = pd.read_excel('dataset 2.xlsx')

## Slicing using loc
- 1st field is for row and then followed by : post that which columns

In [15]:
df1.loc[10:'bmi']

     Policy no.  age     sex    bmi  charges in INR
10    PLC156988   25    male  26.22       2721.3208
11    PLC156997   62  female  26.29      27808.7251
12    PLC157006   23    male  34.40       1826.8430
13    PLC157015   56  female  39.82      11090.7178
14    PLC157024   27    male  42.13      39611.7577
...         ...  ...     ...    ...             ...
1334  PLC168904   18  female  31.92       2205.9808
1335  PLC168913   18  female  36.85       1629.8335
1336  PLC168922   21  female  25.80       2007.9450
1337  PLC168931   61  female  29.07      29141.3603
1338  PLC168935   36     NaN    NaN      32343.5600

[1329 rows x 5 columns]

### Data Access functions: loc and iloc

In [18]:
# iloc stands for index location
# excludes last value of both row and column. in below case 4 of both is excluded
df1.iloc[0:4, 0:4]

  Policy no.  age     sex     bmi
0  PLC156898   19  female  27.900
1  PLC156907   18    male  33.770
2  PLC156916   28    male  33.000
3  PLC156925   33    male  22.705

In [19]:
#get 1st row and 1st column
df1.iloc[0:1, 0:1]

  Policy no.
0  PLC156898

In [22]:
# row 141 to 165 and 3rd and 4th column
df1.iloc[0:165, 2:4]

        sex     bmi
0    female  27.900
1      male  33.770
2      male  33.000
3      male  22.705
4      male  28.880
..      ...     ...
160  female  26.600
161  female  36.850
162    male  39.600
163  female  29.800
164    male  29.640

[165 rows x 2 columns]

In [24]:
# row 1000 to 1015 and 1ST 4 column
df1.iloc[1000:1016, 0:4]

     Policy no.  age     sex     bmi
1000  PLC165898   30    male  22.990
1001  PLC165907   24    male  32.700
1002  PLC165916   24    male  25.800
1003  PLC165925   48    male  29.600
1004  PLC165934   47    male  19.190
1005  PLC165943   29    male  31.730
1006  PLC165952   28    male  29.260
1007  PLC165961   47    male  28.215
1008  PLC165970   25    male  24.985
1009  PLC165979   51    male  27.740
1010  PLC165988   48  female  22.800
1011  PLC165997   43    male  20.130
1012  PLC166006   61  female  33.330
1013  PLC166015   48    male  32.300
1014  PLC166024   38  female  27.600
1015  PLC166033   59    male  25.460

In [29]:
df1.iloc[-2:, -2:]

        bmi  charges in INR
1337  29.07      29141.3603
1338    NaN      32343.5600

In [30]:
df1.iloc[-2, -2]

29.07

In [26]:
df1.tail

<bound method NDFrame.tail of      Policy no.  age     sex     bmi  charges in INR
0     PLC156898   19  female  27.900     16884.92400
1     PLC156907   18    male  33.770      1725.55230
2     PLC156916   28    male  33.000      4449.46200
3     PLC156925   33    male  22.705     21984.47061
4     PLC156934   32    male  28.880      3866.85520
...         ...  ...     ...     ...             ...
1334  PLC168904   18  female  31.920      2205.98080
1335  PLC168913   18  female  36.850      1629.83350
1336  PLC168922   21  female  25.800      2007.94500
1337  PLC168931   61  female  29.070     29141.36030
1338  PLC168935   36     NaN     NaN     32343.56000

[1339 rows x 5 columns]>

In [37]:
df1.loc[1336:1337, "age":"bmi"]

      age     sex    bmi
1336   21  female  25.80
1337   61  female  29.07

In [39]:
df1.iloc[1336:1338, 1:4]

      age     sex    bmi
1336   21  female  25.80
1337   61  female  29.07

In [40]:
df1.iloc[-3:-1, 1:4]

      age     sex    bmi
1336   21  female  25.80
1337   61  female  29.07

In [41]:
df1.iloc[-3:-1, -4:-1]

      age     sex    bmi
1336   21  female  25.80
1337   61  female  29.07